In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 0.49671289, -0.39302433,  0.62826599],
       [-0.11858462, -2.43605376, -0.28385283],
       [-0.81464032,  0.53416416,  1.11115498],
       [-1.05899894,  0.72804745,  1.30645121]])

In [5]:
dataFrame = pd.DataFrame(data)

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [9]:
dataFrame

          0         1         2
0  0.496713 -0.393024  0.628266
1 -0.118585 -2.436054 -0.283853
2 -0.814640  0.534164  1.111155
3 -1.058999  0.728047  1.306451

In [10]:
yeniDataFrame = pd.DataFrame(data,index=["Burak","Ahmet","Mehmet","Nur"],columns= ["Maaş","Yaş","Saat"])

In [11]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [12]:
yeniDataFrame["Yaş"]

Burak    -0.393024
Ahmet    -2.436054
Mehmet    0.534164
Nur       0.728047
Name: Yaş, dtype: float64

In [13]:
yeniDataFrame["Saat"]

Burak     0.628266
Ahmet    -0.283853
Mehmet    1.111155
Nur       1.306451
Name: Saat, dtype: float64

In [15]:
yeniDataFrame[["Maaş","Yaş"]]

            Maaş       Yaş
Burak   0.496713 -0.393024
Ahmet  -0.118585 -2.436054
Mehmet -0.814640  0.534164
Nur    -1.058999  0.728047

In [16]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [18]:
yeniDataFrame.loc["Burak"]

Maaş    0.496713
Yaş    -0.393024
Saat    0.628266
Name: Burak, dtype: float64

In [19]:
yeniDataFrame.loc["Ahmet"]

Maaş   -0.118585
Yaş    -2.436054
Saat   -0.283853
Name: Ahmet, dtype: float64

In [20]:
yeniDataFrame.iloc[1]

Maaş   -0.118585
Yaş    -2.436054
Saat   -0.283853
Name: Ahmet, dtype: float64

In [21]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [22]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"]

In [23]:
yeniDataFrame

            Maaş       Yaş      Saat  Emeklilik Yaşı
Burak   0.496713 -0.393024  0.628266       -0.786049
Ahmet  -0.118585 -2.436054 -0.283853       -4.872108
Mehmet -0.814640  0.534164  1.111155        1.068328
Nur    -1.058999  0.728047  1.306451        1.456095

In [28]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1)

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [29]:
yeniDataFrame

            Maaş       Yaş      Saat  Emeklilik Yaşı
Burak   0.496713 -0.393024  0.628266       -0.786049
Ahmet  -0.118585 -2.436054 -0.283853       -4.872108
Mehmet -0.814640  0.534164  1.111155        1.068328
Nur    -1.058999  0.728047  1.306451        1.456095

In [32]:
yeniDataFrame.drop("Ahmet")

            Maaş       Yaş      Saat  Emeklilik Yaşı
Burak   0.496713 -0.393024  0.628266       -0.786049
Mehmet -0.814640  0.534164  1.111155        1.068328
Nur    -1.058999  0.728047  1.306451        1.456095

In [33]:
yeniDataFrame

            Maaş       Yaş      Saat  Emeklilik Yaşı
Burak   0.496713 -0.393024  0.628266       -0.786049
Ahmet  -0.118585 -2.436054 -0.283853       -4.872108
Mehmet -0.814640  0.534164  1.111155        1.068328
Nur    -1.058999  0.728047  1.306451        1.456095

In [34]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1, inplace=True)

In [35]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [37]:
yeniDataFrame.loc["Burak"]

Maaş    0.496713
Yaş    -0.393024
Saat    0.628266
Name: Burak, dtype: float64

In [38]:
yeniDataFrame.loc["Burak"]["Yaş"]

-0.393024327239039

In [39]:
yeniDataFrame.loc["Burak","Yaş"]

-0.393024327239039

In [40]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713 -0.393024  0.628266
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640  0.534164  1.111155
Nur    -1.058999  0.728047  1.306451

In [43]:
booleanFrame = yeniDataFrame<0

In [44]:
booleanFrame

         Maaş    Yaş   Saat
Burak   False   True  False
Ahmet    True   True   True
Mehmet   True  False  False
Nur      True  False  False

In [45]:
yeniDataFrame[booleanFrame]

            Maaş       Yaş      Saat
Burak        NaN -0.393024       NaN
Ahmet  -0.118585 -2.436054 -0.283853
Mehmet -0.814640       NaN       NaN
Nur    -1.058999       NaN       NaN

In [47]:
yeniDataFrame[yeniDataFrame<0] = 0

In [48]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713  0.000000  0.628266
Ahmet   0.000000  0.000000  0.000000
Mehmet  0.000000  0.534164  1.111155
Nur     0.000000  0.728047  1.306451

In [51]:
yeniDataFrame[yeniDataFrame["Yaş"] >0 ]

        Maaş       Yaş      Saat
Mehmet   0.0  0.534164  1.111155
Nur      0.0  0.728047  1.306451

In [52]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713  0.000000  0.628266
Ahmet   0.000000  0.000000  0.000000
Mehmet  0.000000  0.534164  1.111155
Nur     0.000000  0.728047  1.306451

In [56]:
yeniDataFrame.reset_index()

    index      Maaş       Yaş      Saat
0   Burak  0.496713  0.000000  0.628266
1   Ahmet  0.000000  0.000000  0.000000
2  Mehmet  0.000000  0.534164  1.111155
3     Nur  0.000000  0.728047  1.306451

In [57]:
yeniDataFrame

            Maaş       Yaş      Saat
Burak   0.496713  0.000000  0.628266
Ahmet   0.000000  0.000000  0.000000
Mehmet  0.000000  0.534164  1.111155
Nur     0.000000  0.728047  1.306451

In [58]:
yeniIndexListesi = ["B","A","M","N"]

In [69]:
yeniDataFrame["Yeni İndex"] = yeniIndexListesi

In [70]:
yeniIndexListesi

['B', 'A', 'M', 'N']

In [71]:
yeniDataFrame

               Maaş       Yaş      Saat Yeni İndex
Yeniİndex
B          0.496713  0.000000  0.628266          B
A          0.000000  0.000000  0.000000          A
M          0.000000  0.534164  1.111155          M
N          0.000000  0.728047  1.306451          N

In [72]:
yeniDataFrame.set_index("Yeni İndex", inplace=True)

In [73]:
yeniDataFrame

                Maaş       Yaş      Saat
Yeni İndex
B           0.496713  0.000000  0.628266
A           0.000000  0.000000  0.000000
M           0.000000  0.534164  1.111155
N           0.000000  0.728047  1.306451

In [74]:
yeniDataFrame

                Maaş       Yaş      Saat
Yeni İndex
B           0.496713  0.000000  0.628266
A           0.000000  0.000000  0.000000
M           0.000000  0.534164  1.111155
N           0.000000  0.728047  1.306451

In [75]:
yeniDataFrame.loc["A"]

Maaş    0.0
Yaş     0.0
Saat    0.0
Name: A, dtype: float64

In [76]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [77]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [78]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [79]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [80]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [81]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [82]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [84]:
benimCartoonListem = [[40,"A"],[30,"B"],[25,"C"],[15,"D"],[11,"E"],[32,"F"]]

In [85]:
benimCartoonListem = np.array(benimCartoonListem)

In [87]:
cartoonFrame = pd.DataFrame(benimCartoonListem, index = birlesmisIndex,columns=["Yaş","Meslek"])

In [88]:
cartoonFrame

                   Yaş Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    25      C
South Park Cartman  15      D
           Kenny    11      E
           Kyle     32      F

In [89]:
cartoonFrame.loc["Simpson"]

      Yaş Meslek
Homer  40      A
Bart   30      B
Marge  25      C

In [91]:
cartoonFrame.loc["South Park"].loc["Kenny"]

Yaş       11
Meslek     E
Name: Kenny, dtype: object

In [92]:
cartoonFrame.index.names = ["Film Adı","İsim"]

In [93]:
cartoonFrame

                   Yaş Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     30      B
           Marge    25      C
South Park Cartman  15      D
           Kenny    11      E
           Kyle     32      F